Revit 2027 API
CompoundStructure.ResetAllLayersPriorities Method
 Resets all the priorities of all layers to the default priorities defined by their functions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetAllLayersPriorities()
Public Sub ResetAllLayersPriorities
public:
void ResetAllLayersPriorities()
member ResetAllLayersPriorities : unit -> unit
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace